#### BuiltInFailures.CopyPasteFailures Members

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures CopyPasteFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCopyAttachedType | Cannot copy attached detail group type without copying the model group type it refers to. |
| Public property Static member | CannotCopyAttachedTypeWarn | Cannot copy attached detail group type without copying the model group type it refers to. |
| Public property Static member | CannotCopyBetweenFamilyAndProjectCorruption | Can't copy between Family and Project. |
| Public property Static member | CannotCopyBetweenFamilyAndProjectError | Can't copy between Family and Project. |
| Public property Static member | CannotCopyCurtainWallGridLines | Curtain wall grid lines currently cannot be copied. |
| Public property Static member | CannotCopyDependentView | Dependent views cannot be copied. |
| Public property Static member | CannotCopyDetails | Can't copy some or all of the detailing with the view. |
| Public property Static member | CannotCopyDueToBackgroundCalculation | Cannot copy dragged elements while background calculations are in progress. |
| Public property Static member | CannotCopyDuplicates | Can't paste duplicate types. Only non duplicate types will be pasted. |
| Public property Static member | CannotCopyElevationArrow | To duplicate Elevations, copy the elevation symbol in a plan view. |
| Public property Static member | CannotCopyElevationArrowWarn | To duplicate Elevations, copy the elevation symbol in a plan view. |
| Public property Static member | CannotCopyFamilyName | Can't [Action] because Family '[Family Name]' is different in the two documents. Update the documents to contain the same version of the Family. |
| Public property Static member | CannotCopyFromProjectAndLink | Can't Copy to Clipboard elements from the project and a link instance at the same time. Only elements from the project will be copied. |
| Public property Static member | CannotCopyGridLines | Curtain grid lines cannot be copied. If you are trying to copy the curtain wall, try using tab to select entire wall. |
| Public property Static member | CannotCopyGridLinesWarn | Curtain grid lines cannot be copied. If you are trying to copy the curtain wall, try using tab to select entire wall. |
| Public property Static member | CannotCopyImportInstancesAcrossProjects | Linked Imported Files cannot be copied across projects. All non-RVT linked files will be pasted as imports instead. |
| Public property Static member | CannotCopyIncompleteElement | Can't copy part of element |
| Public property Static member | CannotCopyIncompleteElementWarn | Can't copy part of element |
| Public property Static member | CannotCopyJoinedGeometry | Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them. |
| Public property Static member | CannotCopyJoinedGeometryWarn | Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them. |
| Public property Static member | CannotCopyLocked | Can't copy pinned element. |
| Public property Static member | CannotCopyLockedWarn | Can't copy pinned element. |
| Public property Static member | CannotCopyMassing | A massing cannot be copied. Copy the elements within the massing instead. |
| Public property Static member | CannotCopyMassingWarn | A massing cannot be copied. Copy the elements within the massing instead. |
| Public property Static member | CannotCopyMullions | Mullions and panels cannot be copied without copying the entire curtain wall. |
| Public property Static member | CannotCopyMullionsError | Mullions and panels cannot be copied without copying the entire curtain wall. |
| Public property Static member | CannotCopyMullionsWarn | Mullions and panels cannot be copied without copying the entire curtain wall. |
| Public property Static member | CannotCopyMultipleSketchParents | Copying elements from unrelated Workplanes together is not supported in families. Try copying elements separately. |
| Public property Static member | CannotCopyMustBeUnique | Element must be unique. |
| Public property Static member | CannotCopyMustBeUniqueViewport | Multiple instances of the same view in sheets not supported. CannotCopyMustBeUniqueViewport is deprecated in Revit 2023 and may be removed in future version of Revit. Please use ViewInAModelMustBeUnique instead. |
| Public property Static member | CannotCopyMustBeUniqueViewportWarn | Multiple instances of the same view in sheets not supported. CannotCopyMustBeUniqueViewportWarn is deprecated in Revit 2023 and may be removed in future verison of Revit. Please use ViewInAModelMustBeUniqueWarn instead. |
| Public property Static member | CannotCopyMustBeUniqueWarn | Element must be unique. |
| Public property Static member | CannotCopyNestedLinks | To copy a nested link, use Copy to Clipboard or Move Copy. |
| Public property Static member | CannotCopyNoAttachedParent | Attached Detail Group can't be copied without its Model Group |
| Public property Static member | CannotCopyNoAttachedParentWarn | Attached Detail Group can't be copied without its Model Group |
| Public property Static member | CannotCopyNoParents | Can't Copy to Clipboard because of relationships between Elements |
| Public property Static member | CannotCopyNoReferences | Elements can't be copied because they will lose their References. |
| Public property Static member | CannotCopyRevolveAxis | The axis cannot be copied. |
| Public property Static member | CannotCopyRevolveAxisWarn | The axis cannot be copied. |
| Public property Static member | CannotCopySelectedPick | The element being dragged can't be copied. |
| Public property Static member | CannotCopySelection | Cannot copy selection.[Description] |
| Public property Static member | CannotCopySketchGrid | Work Planes cannot be copied. |
| Public property Static member | CannotCopySketchGridWarn | Work Planes cannot be copied. |
| Public property Static member | CannotCopySunAndShadowSettings | SunAndShadowSettings cannot be copied. |
| Public property Static member | CannotCopySunAndShadowSettingsWarn | SunAndShadowSettings cannot be copied. |
| Public property Static member | CannotCopyWallPanels | Cannot copy wall panels unless their parent wall is also being copied. |
| Public property Static member | CannotCopyWallPanelsWarn | Cannot copy wall panels unless their parent wall is also being copied. |
| Public property Static member | CannotCopyZone | A Zone cannot be copied. |
| Public property Static member | CannotCopyZoneWarn | A Zone cannot be copied. |
| Public property Static member | CannotDuplicate | Elements can't be duplicated |
| Public property Static member | CannotDuplicateDesignOption | Can't duplicate Design Option. |
| Public property Static member | CannotDuplicateInOption | Elements can't be duplicated in a secondary Option |
| Public property Static member | CannotDuplicateInOptionWarn | Elements can't be duplicated in a secondary Option |
| Public property Static member | CannotDuplicateType | Cannot Duplicate Type. |
| Public property Static member | CannotDuplicateWarn | Elements can't be duplicated |
| Public property Static member | CannotFinalizeClusterInconsistency | Can't finalize because dependent element failed to finalize. |
| Public property Static member | CannotFinalizeOrphanSerf | Can't finalize Group member without finalizing the entire Group. |
| Public property Static member | CannotPasteAlignedAny | Can't Paste Aligned. |
| Public property Static member | CannotPasteAlignedCorruption | Can't Paste Aligned these elements in this view. |
| Public property Static member | CannotPasteAlignedError | Can't Paste Align these elements in this view. |
| Public property Static member | CannotPasteAlignedSomeLevels | Can't Paste Aligned to some views. |
| Public property Static member | CannotPasteAssemblyView | Can't paste assembly view because its associated assembly instance is not available. |
| Public property Static member | CannotPasteCircularLinks | The pasted selection includes a linked instance of this file '[Name]'. A file cannot link itself, so the link was not pasted. |
| Public property Static member | CannotPasteCurtainGridLine | Can't paste Curtain Grid Line. |
| Public property Static member | CannotPasteDifferentViewSpecificElements | Cannot paste view-specific elements from different views. |
| Public property Static member | CannotPasteElemInViewError | Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view. |
| Public property Static member | CannotPasteInSketch | Can't paste elements into sketch. |
| Public property Static member | CannotPasteInView | Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view. |
| Public property Static member | CannotPasteInViewError | Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view. |
| Public property Static member | CannotPasteModelPlusViewSpecificElementsIntoView | Cannot paste view-specific model plus into view. |
| Public property Static member | CannotPasteNoLevelAbove | Can't paste these elements at this height because there is no Level above to Reference. |
| Public property Static member | CannotPasteNoLevelBelow | Can't paste these elements at this height because there is no Level below to reference. |
| Public property Static member | CannotPasteNoWorkplane | Can't paste because there is no corresponding Work Plane. Set workplane or switch to view with appropriate workplane. |
| Public property Static member | CannotPasteRoomsInNonPlanViews | [Rooms] can only be pasted in Plan or Ceiling Plan views. |
| Public property Static member | CannotPasteToSheet | Elements copied to Sheets can only be copied from other Sheets. |
| Public property Static member | CannotPasteViewSpecElemsFromDiffViews | Cannot paste view-specific elements from different views. |
| Public property Static member | CannotPasteViewSpecificElementsIntoPerspectiveView | Can't paste view specific elements into perspective view. |
| Public property Static member | CannotTransferProjectStandards | These Project Standards cannot be transferred.[Description] |
| Public property Static member | CantCopyBetweenModelAndAnnotFam | Can't copy element(s) between Model and Annotation families. |
| Public property Static member | CantCopyElemsToInplaceFam | Can't copy element(s) to In Place family. |
| Public property Static member | CantCopyFrom2dTo3dFam | Can't copy 2D element(s) into a 3D family. |
| Public property Static member | CantCopyFrom3dTo2dFam | Can't copy 3D element(s) into a 2D family. |
| Public property Static member | CantCopyFromDetailToProfileFam | Can't copy Detail element(s) into a Profile family. |
| Public property Static member | CantCopyLevelsOrRefPlanesToNonMassFamily | Can't copy levels or reference planes to families that are not Mass families. |
| Public property Static member | CantCopyStairsLevelHeightNotMatchInMS | Can't copy stairs in Multistory Stairs due to level height doesn't match. |
| Public property Static member | CantCopySymbolicElementToSelfOrientingFamily | Cannot copy symbolic elements sketched in non-horizontal planes. |
| Public property Static member | CopingColumnBeamFailure | The support order for a beam/column connection has been changed. When a beam is supported by a column that same beam cannot be coped by the column. The existing coping has been removed. |
| Public property Static member | CopyImposterContentError | Cannot copy Render Appearance. |
| Public property Static member | CopyImposterContentWarn | Cannot copy Render Appearance. |
| Public property Static member | CopyImposterLightError | Light source cannot be copied! |
| Public property Static member | CopyImposterLightWarn | Light source cannot be copied! |
| Public property Static member | ElementRenamedOnPaste | The loaded type "[Name]" has been renamed to "[New Name]" to avoid conflicts with the existing type. |
| Public property Static member | FinalizedElementsWillBeDeleted | Can't find new hosts for this Element.\nIt will be deleted on Finish Paste unless repositioned or rehosted. |
| Public property Static member | FinalizedElementsWillBeDeletedWarn | Can't find new hosts for this Element.\nIt will be deleted on Finish Paste unless repositioned or rehosted. |
| Public property Static member | FinalizedElementsWillBeModified | Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted. |
| Public property Static member | FinalizedElementsWillBeModifiedWarn | Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted. |
| Public property Static member | LostReference | A relationship between Elements in [Option Name] and [Reference Option Name] has been deleted. There is no corresponding relationship in the Primary [New Primary Option Name]. |
| Public property Static member | NoSketchPlane | Can't paste because no Work Plane is defined in the View. |
| Public property Static member | PasteInvisibleInView | Selection is invisible in this view. |
| Public property Static member | SomeElementsNotCopiedWarn | Some elements were not copied.[Description] |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace